Project/Toir.Adaptation/src/Enums/торо_СтатусыДокументов/торо_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_СтатусыДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e3824168-331e-4e9c-9a97-88d442450c1c">
    <name>гкс_ВыполненНеобходимАктПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b486cddf-c606-48a0-b4d9-79359f8995b4">
    <name>Устраняется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="12013120-ddb7-448d-8a52-b1a0212dd9c4">
    <name>Выполнен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="17242492-094d-4d6f-805a-a10d65fa8670">
    <name>Зарегистрирован</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="62ccdc8a-74d4-48f3-bfc6-e3928a0ae7cb">
    <name>ВозобновленоПослеОтказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e4ffdb13-bdf4-4105-92f1-9c5dc748637d">
    <name>Выполняется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="91bc17f5-8b7c-487f-8759-3e891929fcc6">
    <name>ОтказИсполнителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="97ff8156-77b5-45f9-93d6-665a3335a2bf">
    <name>ОтказПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ee12e5d3-3edb-491c-8af6-c4cb0fc16d16">
    <name>гкс_Новый</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/CommonModules/торо_РаботаСоСтатусамиДокументовПовтИсп/Module.bsl
&ИзменениеИКонтроль("ПолучитьТаблицуУстанавливаемыхСтатусовДляАктаОВыполненииЭтапаРабот")
Функция гкс_ПолучитьТаблицуУстанавливаемыхСтатусовДляАктаОВыполненииЭтапаРабот(ДокументыОснования, ЗавершитьРемонтныеРаботы)

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВыявленныеДефекты"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ЗаявкаНаРемонт"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот"));

	ТаблицаУстанавливаемыхСтатусов = Новый ТаблицаЗначений;
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов(МассивТипов));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("УстанавливаемыйСтатус", Новый ОписаниеТипов("ПеречислениеСсылка.торо_СтатусыДокументов"));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));

	Для каждого Стр Из ДокументыОснования Цикл

		Если ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ВыявленныеДефекты") Тогда

			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ВыявленныеДефекты.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;

			Если ЗавершитьРемонтныеРаботы Тогда

				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устранен;
				НС.Порядок = 3;

			Иначе

				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устраняется;
				НС.Порядок = 2;

			КонецЕсли;

		ИначеЕсли ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда

			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;

			Если ЗавершитьРемонтныеРаботы Тогда

				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устранен;
				НС.Порядок = 3;

			Иначе

				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устраняется;
				НС.Порядок = 2;

			КонецЕсли;

		ИначеЕсли ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда

			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;

			Если ЗавершитьРемонтныеРаботы Тогда

				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполнен;
				#Удаление 
				НС.Порядок = 3;
				#КонецУдаления
				#Вставка 
				НС.Порядок = 4;
				#КонецВставки
			Иначе
				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполняется;
				НС.Порядок = 2;

			КонецЕсли;

		ИначеЕсли ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда

			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;

			Если ЗавершитьРемонтныеРаботы Тогда

				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполнен;
				НС.Порядок = 2;

			Иначе

				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполняется;
				НС.Порядок = 1;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;


	Возврат ТаблицаУстанавливаемыхСтатусов;


КонецФункции

&ИзменениеИКонтроль("ПолучитьТаблицуУстанавливаемыхСтатусов")
Функция гкс_ПолучитьТаблицуУстанавливаемыхСтатусов(ТипДокументаСтрока, ДокументыОснования, ЗавершитьРемонтныеРаботы)

	Если ТипДокументаСтрока = "ДокументСсылка.торо_ЗаявкаНаРемонт" Тогда
		Возврат ПолучитьТаблицуУстанавливаемыхСтатусовДляЗаявки(ДокументыОснования);
	ИначеЕсли ТипДокументаСтрока = "ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот" Тогда
		Возврат ПолучитьТаблицуУстанавливаемыхСтатусовДляНаряда(ДокументыОснования);
	ИначеЕсли ТипДокументаСтрока = "ДокументСсылка.торо_АктОВыполненииЭтапаРабот" Тогда
		Возврат ПолучитьТаблицуУстанавливаемыхСтатусовДляАктаОВыполненииЭтапаРабот(ДокументыОснования, ЗавершитьРемонтныеРаботы);
	ИначеЕсли ТипДокументаСтрока = "ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия" Тогда
		Возврат ПолучитьТаблицуУстанавливаемыхСтатусовДляАктаОВыполненииРегламентногоМероприятия(ДокументыОснования, ЗавершитьРемонтныеРаботы);
	ИначеЕсли ТипДокументаСтрока = "ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов" Тогда
		Возврат ПолучитьТаблицуУстанавливаемыхСтатусовДляЗакрытияЗаявокИРемонтов(ДокументыОснования);
	ИначеЕсли ТипДокументаСтрока = "ДокументСсылка.торо_ВыявленныеДефекты" Тогда
		Возврат ПолучитьТаблицуУстанавливаемыхСтатусовДляВыявленныхДефектов(ДокументыОснования);		
	КонецЕсли;	

КонецФункции
